app/views/posts/show.html.erb

    <h5 class="subtitle">
      <%= @post.comments.count %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 13]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 13]]