app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Jame Odufu"], ["comment", "I love this.\r\nThanks for sharing.."], ["created_at", "2021-06-20 16:45:42.897554"], ["updated_at", "2021-06-20 16:45:42.897554"], ["post_id", 18]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)